<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"29a271704215da8fc31055d1406552b1ae671f909f679c2422f6c7a5a96bfd0b","plan_job_ref":"Job Staging Image Build & Push #10 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343939777","plan_hash":"92574f6602c19d89b53aa3636207ee9bacf81c2b386e3b77ff7fe230e7562100","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster will be updated in-place
!~  resource "aws_ecs_cluster" "fastapi-cluster" {
        id       = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
        name     = "fastapi-cluster"
!~      tags     = {
-           "Environment" = "Prod Environment" -> null
        }
!~      tags_all = {
!~          "Environment" = "Prod Environment" -> "Dev Environment"
        }
#        (1 unchanged attribute hidden)

#        (1 unchanged block hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:10" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:10" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:e1fdf9873ba2907e57674ce2e891eb94a5dc289c" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:c3f28675e8fc6ca54d7f0e468af2270ab082ced2"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 10 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_route53_record.record will be created
+   resource "aws_route53_record" "record" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "test.fastapi.dennisowie.com"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = "fastapi-lb-dev-811773905.eu-central-1.elb.amazonaws.com"
+           zone_id                = "**************"
        }
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #10](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343939777)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>